README.md

# Table of Contents

1.  [Installation](#org6f20b77)
    1.  [Prerequisites](#org87aeb01)
2.  [Introduction](#org8719744)
3.  [Features](#org2dee5dd)
4.  [Usage](#orge38b2b6)
    1.  [Commands](#orgdc50593)
5.  [Customization](#org0d4ace6)
    1.  [Collections](#org49e2732)
    2.  [Filters](#org55cb99c)
6.  [-list](#org9c60969)
7.  [Contribute](#org2c3759a)



<a id="org6f20b77"></a>

# Installation

TODO: Installation instructions


<a id="org87aeb01"></a>

## Prerequisites

-   Emacs 26.1+
-   OPTIONAL: [all-the-icons](https://github.com/domtronn/all-the-icons.el)


<a id="org8719744"></a>

# Introduction

Star Tabs aims to be a highly customizable and functional tab bar solution for Emacs, with focus on efficient and fast buffer navigation using numbers to
identify tabs. In the normal case, switching to any buffer is only 2-4 keystrokes away (its true power is unleashed in evil-mode!), and buffers can easily be arranged and displayed to your needs. 


<a id="org2dee5dd"></a>

# Features

TODO


<a id="orge38b2b6"></a>

# Usage

TODO


<a id="orgdc50593"></a>

## Commands

TODO


<a id="org0d4ace6"></a>

# Customization

TODO


<a id="org49e2732"></a>

## Collections

TODO


<a id="org55cb99c"></a>

## Filters

TODO


<a id="org9c60969"></a>

# TODO -list

TODO


<a id="org2c3759a"></a>

# Contribute

